airFoil2D_test/0/nuTilda
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      nuTilda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0.14;

boundaryField
{
    minX
    {
        type            freestream;
        freestreamValue uniform 0.14;
    }

    maxX
    {
        type            freestream;
        freestreamValue uniform 0.14;
    }
    maxY
    {
        type            freestream;
        freestreamValue uniform 0.14;
    }
    minY
    {
        type            freestream;
        freestreamValue uniform 0.14;
    }

    stlSurface
    {
        type            fixedValue;
        value           uniform 0;
    }

    minZ
    {
        type            empty;
    }
    maxZ
    {
        type            empty;
    }
}

// ************************************************************************* //
