airFoil2D_test/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    minX
    {
        type            freestreamPressure;
        freestreamValue $internalField;
    }

    maxX
    {
        type            freestreamPressure;
        freestreamValue $internalField;
    }

    maxY
    {
        type            freestreamPressure;
        freestreamValue $internalField;
    }

    minY
    {
        type            freestreamPressure;
        freestreamValue $internalField;
    }

    stlSurface
    {
        type            zeroGradient;
    }

    minZ
    {
        type            empty;
    }
    maxZ
    {
        type            empty;
    }
}

// ************************************************************************* //
