airFoil2D_test/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    minX
    {
        type            patch;
        nFaces          160;
        startFace       917314;
    }
    maxX
    {
        type            patch;
        nFaces          160;
        startFace       917474;
    }
    minY
    {
        type            patch;
        nFaces          240;
        startFace       917634;
    }
    maxY
    {
        type            patch;
        nFaces          240;
        startFace       917874;
    }
    minZ
    {
        type            empty;
        nFaces          116450;
        startFace       918114;
    }
    maxZ
    {
        type            empty;
        nFaces          116450;
        startFace       1034564;
    }
    stlSurface
    {
        type            wall;
        nFaces          33056;
        startFace       1151014;
    }
)

// ************************************************************************* //
