airFoil2D_test/system/forceCoeffsIncompressible
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Calculates lift, drag and moment coefficients by summing forces on
    specified patches for a case where the solver is incompressible (pressure
    is kinematic, e.g. m^2/s^2).

\*---------------------------------------------------------------------------*/

patches     (wall);

magUInf     52.08;
Aref        1;
dragDir     (0.9961946980917455 0.08715574274765817 0);
liftDir     (0.08715574274765817 0.9961946980917455 0);

// Moment calculation parameters without it doesn't work
lRef        1;
CofR        (0 0 0);
pitchAxis   (0 1 0);

#includeEtc "caseDicts/functions/forces/forceCoeffsIncompressible.cfg"


// ************************************************************************* //
